SPedt_!/src/Documents/Движение/Движение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Движение</name>
  <comment>Движение товара</comment>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОпераций_ДвижениеСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Построчно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоставки</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ГабаритНазначение</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХраненияНазначение</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачиНазначение</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизаторНазначение</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПокупкиТранзит</name>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Точка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/Enums/ВидыОпераций_ДвижениеСклад/ВидыОпераций_ДвижениеСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОпераций_ДвижениеСклад</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаТранзит</name>
  </enumValues>
</mdclass:Enum>

SPedt_!/src/Documents/Движение/ObjectModule.bsl
перем  мОстанавливатьПриходПриОшибке экспорт;

Процедура ОбработкаПроведения(Отказ, Режим)
	#Область ПравильноеПроведение
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
	Документы.Движение.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	
СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Обмен100СПрн",	ДополнительныеСвойства, Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Транзит",		ДополнительныеСвойства, 	Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Возвраты",	ДополнительныеСвойства, 	Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("ОстаткиТоваров",ДополнительныеСвойства, 	Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Расход",		ДополнительныеСвойства, 	Движения, Отказ);
	#КонецОбласти	
	
	
	 
КонецПроцедуры





Процедура ЗаполнитьПоОтборуТовары(Параметры) Экспорт
	
	Схема	= ПолучитьМакет("СКДОтборТовары");
	КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.ВариантыНастроек["Основной"].Настройки);
	
	настройки=КомпоновщикНастроек.Настройки;
	
	Для Каждого Элем из Параметры Цикл
		Если ТипЗнч(элем.Значение) 	<> Тип("Структура") Тогда Продолжить; КонецЕсли;
		полеОтбора		= КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти(Элем.Ключ);
		Если ПолеОтбора = Неопределено Тогда Продолжить; КонецЕсли;
		
		НовыйОтбор 					= настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение	= полеОтбора.Поле;
		ЗаполнитьЗначенияСвойств(НовыйОтбор, элем.Значение);
	КонецЦикла;
	
	
	параметрПериод					= настройки.ПараметрыДанных.НайтиЗначениеПараметра(новый ПараметрКомпоновкиДанных("ДатаОтчета"));
	параметрПериод.Значение			= КонецДня(Параметры.ДатаОтчета);
	параметрПериод.Использование	= Истина;
	
	КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(настройки);
	
	КомпановщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет	=	КомпановщикМакета.Выполнить(Схема,КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки= новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорВывода=новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ=новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
	//Если   ВидОперации  =Перечисления.ВидыОпераций_ДвижениеСклад.СписаниеТранзита  или
	//	   ВидОперации  =Перечисления.ВидыОпераций_ДвижениеСклад.СТранзитаНаВозврат или
	//	   ВидОперации  =Перечисления.ВидыОпераций_ДвижениеСклад.СТранзитаНаОстатки Тогда
	//	ПокупкиТранзит.Загрузить(ТЗ);
	//Иначе
		Покупки.Загрузить(ТЗ);
	//КонецЕсли		
КонецПроцедуры	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОпераций_ДвижениеСклад.Перемещение и
		 ПроверяемыеРеквизиты.Найти("МестоХранения") = Неопределено Тогда
		//ПроверяемыеРеквизиты.Добавить("МестоХранения");
	КонецЕсли;
	Если  ВидОперации=Перечисления.ВидыОпераций_ДвижениеСклад.Передача и 
		  ПроверяемыеРеквизиты.Найти("Организатор") = Неопределено Тогда	
		ПроверяемыеРеквизиты.Добавить("Организтор");
	КонецЕсли;	
	
	Если  ВидОперации=Перечисления.ВидыОпераций_ДвижениеСклад.ПередачаНаТранзит и 
		  ПроверяемыеРеквизиты.Найти("ТочкаНазначения") = Неопределено Тогда	
		ПроверяемыеРеквизиты.Добавить("ТочкаНазначения");
	КонецЕсли;	
	
КонецПроцедуры
